---
kind: property
id: P:Autodesk.Revit.DB.SunAndShadowSettings.UsesGroundPlane
source: html/9e3de085-3afd-e61a-d0e6-87659e6e1997.htm
---
# Autodesk.Revit.DB.SunAndShadowSettings.UsesGroundPlane Property

Identifies whether the SunAndShadowSettings element uses a ground plane.

## Syntax (C#)
```csharp
public bool UsesGroundPlane { get; set; }
```